app/controllers/users_controller.rb

  def create
    User.create(user_params)
---
INSERT INTO "users" ("name", "age", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "rie"], ["age", 37], ["created_at", "2020-05-11 15:02:16.311230"], ["updated_at", "2020-05-11 15:02:16.311230"]]

  def update
    user = User.find(params[:id])
    user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "users" SET "age" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["age", 65], ["updated_at", "2020-05-12 10:20:32.592550"], ["id", 7]]